########################################################################
"""Tasks: 1
Написати функцію < square > , яка прийматиме один аргумент - сторону
квадрата, і вертатиме 3 значення (кортеж): периметр квадрата,
площа квадрата та його діагональ.
"""
 ########################################################################
def square(a):
    square=()
    p=a*4
    s=a**2
    d=round(((2*(a**2))**0.5),1)
    square=(p,s,d)
    print(type(square))
    print('Периметр ,Площа, Діагональ ->',square)
    return square 
##########################################################################
a=float(input('Input square a='))
square(a)