########################################################
#Tasks: 1
'''1. Створити цикл від 0 до ... (вводиться користувачем).
В циклі створити умову, яка буде виводити поточне значення,
якщо остача від ділення на 17 дорівнює 0.'''
##########################################################
number=int(input('Input number=? '))
list17=[]
if number>0:
    for i in range(1,number):
        if i%17==0:
            list17.append(i)
            
if number<17:
    print('not number%17=0')
else:
    print('Output: ',list17)