##################################################################
#Tasks: 2
'''2. Користувачем вводиться початковий і кінцевий рік.
Створити цикл, який виведе всі високосні роки в цьому проміжку
(границі включно1.  рік кратний 400
2.  рік кратний 4, але не кратний 100
Примітка: кратний - це коли остача від ділення дорівнює нулю.'''
####################################################################
list_year=[]
year = int(input
           ('input year: '))
end_year = int(input('input end_year: '))
while year<=end_year:
    if (year%400==0):
         list_year.append(year)
    if (year%4==0) and (year%100!=0): 
        list_year.append(year)
    year+=1
print(list_year)

