##############################################################
#Tasks: 3
#пори року (season)
'''3. Написати функцiю season, яка приймає один аргумент
— номер мiсяця
(вiд 1 до 12), яка буде повертати пору року, якiй цей мiсяць належить
(зима, весна, лiто або осiнь)'''
################################################################

def season(n):
    
          
    if (12,1,2).count(n) != 0: #метода count(),которое показывает сколько раз n встречается в ()
       
        s='Winter'
    elif int((3,4,5).count(n)) != 0:
        s='Spring'
    elif (6,7,8).count(n) != 0:
        s='Summer'
    elif (9,10,11).count(n) != 0:
        s='Autumn'
    else:
        s='not numer_season'
        
    return s      
n=int(input('numer_season: '))
print(season(n))

