#################################################################
#Tasks: 5
'''5. Користувач вводить змiннi "x" та "y" з довiльними
цифровими значеннями;
- Створiть просту умовну конструкцiю
звiсно вона повинна бути в тiлi ф-цiї), пiд час виконання якої
буде перевiрятися рiвнiсть змiнних "x" та "y" і при нерiвностi
змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
-  Повиннi опрацювати такi умови:
-  x > y;       вiдповiдь - х бiльше нiж у на z
-  x < y;       вiдповiдь - у бiльше нiж х на z
-  x == y.      вiдповiдь - х дорiвнює z

'''
###################################################################
def x_y(a,b):
    if a==b:
        rez = 'a=b'
    else:
        rez = a-b
    return rez

x=int(input('Input number: '))
y=int(input('Input number: '))
x_y=x_y(x,y)
print('Output: ',x_y)